The  FilePath  type exposes the following members.
 Constructors
Name  |   Description
FilePath
 Constructs a FilePath
 Methods
Name  |   Description
Compare
 Compares this ModelPath with another
 (Inherited from  ModelPath  .)
Dispose   |   (Inherited from  ModelPath  .)
Equals
 Determines whether the specified  Object  is equal to the current  Object  .
 (Inherited from  Object  .)
GetHashCode
 Serves as a hash function for a particular type.
 (Inherited from  Object  .)
GetModelGUID
 A GUID identifying the Autodesk 360 model.
 (Inherited from  ModelPath  .)
GetProjectGUID
 A GUID identifying the Autodesk 360 project to which the model is associated.
 (Inherited from  ModelPath  .)
GetType
 Gets the  Type  of the current instance.
 (Inherited from  Object  .)
ToString
 Returns a string that represents the current object.
 (Inherited from  Object  .)
 Properties
Name  |   Description
CentralServerPath
 A path to the location of the central Revit server.
 (Inherited from  ModelPath  .)
Empty
 Whether this path is empty
 (Inherited from  ModelPath  .)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from  ModelPath  .)
ServerPath
 Whether this path is a server path (as opposed to a file path or cloud path)
 (Inherited from  ModelPath  .)
 See Also
  FilePath Class
  Autodesk.Revit.DB Namespace